Show / Hide Table of Contents
Class OpenModelResult
Results of open model
Inheritance
System.Object
OpenModelResult
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
public class OpenModelResult
Constructors
Improve this Doc   View Source
OpenModelResult()
Constructor
Declaration
public OpenModelResult()
Properties
Improve this Doc   View Source
ResultOnMembers
Results on members
Declaration
public List<ResultOnMembers> ResultOnMembers { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOnMembers>
Methods
Improve this Doc   View Source
LoadFromStream(Stream)
Creates the instance of Open Model Result from the stream
Declaration
public static OpenModelResult LoadFromStream(Stream xmlFileStream)
Parameters
 Type |  Name |  Description
 System.IO.Stream |  xmlFileStream
The input stream
Returns
 Type |  Description
 OpenModelResult
The new instance of Open Model Result
Improve this Doc   View Source
LoadFromXmlFile(String)
Creates the instance of Open Model Result from the XML file
Declaration
public static OpenModelResult LoadFromXmlFile(string xmlFileName)
Parameters
 Type |  Name |  Description
 System.String |  xmlFileName
XML file name
Returns
 Type |  Description
 OpenModelResult
Open Model Result or null
Improve this Doc   View Source
SaveToXmlFile(String)
Saves content into file as a XML format
Declaration
public bool SaveToXmlFile(string xmlFileName)
Parameters
 Type |  Name |  Description
 System.String |  xmlFileName
XML file name
Returns
 Type |  Description
 System.Boolean
True if succeeded
 Improve this Doc
 View Source